[MID_CreditsIntro_TCB]
[eng]
I have to congratulate you for making it through to the end. You may have noticed this game is a little bit difficult.

It took us two years to build *DROD: The City Beneath*, and it was not two years coasting down a gentle slope. We had the usual amount of joy and pain. Making DROD was a dramatic experience that I wouldn't recommend to anybody except myself. You've heard this phrase before, I think:

"All men lead lives of quiet desperation."

When talking to friends of mine, especially in the 30-40 age range, the "quiet desperation" theme comes up all the time. Lots of people wanted to be a photographer, an artist, a professional cyclist, a novelist, a magician, a whatever. They didn't get there, and as years pass, they sense that doors have closed and more are closing. That's where the quiet desperation comes in.

But not me! When I was a dumb little kid, I said I wanted to make games. And I'm making games, so the dumb little kid got his way. On a bad day, I feel like a fat, balding man dressed in a stretched and ripped Peter Pan costume. On a good day, like today, I feel like I did everything right, and I'll get to be one of the small number who live a regret-free life. Today, or at least the time of this writing, is March 31st. Mike is putting the finishing touches on *The City Beneath*. He's waiting for this text you're reading. After I give it to him, we'll be ready to ship on April 1st, exactly two years from our release of *DROD: Journey to Rooted Hold*. Well, "ship" is a more satisfying but inaccurate way of saying that we'll be ready to upload our setup executables to the payment processor. Yeah, "ship" sounds a lot better than U.o.S.E.t.t.P.P.

So what did you think about that ending? Did you understand what you saw? It certainly gave Beethro something to think about. I will tell you now that we've planned another DROD sequel, perhaps the final entry in the tetralogy that began with *King Dugan's Dungeon*, *Journey to Rooted Hold*, and *The City Beneath*. The fourth game will be called "The Second Sky", and will mark the end of Beethro's investigations in the Great Beneath, and the beginning of his actions in aid of the surface. We will also be releasing a fair amount of episodic content through our Smitemaster's Selections that cover a time period between *The City Beneath* and *The Second Sky*. I don't think we will hold up the story for the *The Second Sky* either. We went light on plot events in the previous Smitemaster's Selections, but I think we will be putting major happenings into them in the future.

So I'm teasing you about *The Second Sky*, but I have to warn you that our next full-length game is not going to be *The Second Sky* or even a DROD game. I'll take a moment for you to recover from that statement.

...

Yeah, it won't be a DROD game. Mike and I want to spread our wings a little and try making some other games we've kept in our imaginations for some time. I've been working on different versions of DROD for over a decade now, and Mike has been at it for a substantial five years. It's time to bring some other ideas into reality, so we can keep feeling excited about what we're making. Don't worry, though--we aren't going to dump a Tetris clone or first-person shooter on you. Naw, it's gonna be more of that contemplative puzzle-solving stuff that we've all learned to love.

Let's do the credits now, and after that, I will tell you a secret.

[rus]
Хочу поздравить вас с тем, что вам удалось добраться до самого конца. Наверняка, вы заметили, что эта игра довольно сложная.

У нас ушло два года на создание *ДРОД: Подземный Город* и, надо сказать, эти два года мы не меды распивали. Бывали моменты радостные, бывали не очень, все как всегда. Создание ДРОДа было волнующим опытом, которого я не желал бы никому, кроме себя. Думаю, вы наверняка слышали эту фразу раньше:

"Все люди проживают жизни в тихом отчаянии."

Когда мы разговариваем с друзьями, преимущественно 30-40 лет, тема "тихого отчаяния" всплывает постоянно. Многие хотели стать фотографом, художником, профессиональным велосипедистом, писателем, фокусником или кем-то еще. Им это не удавалось. Шли годы, и они чувствовали, что многие двери для них закрыты и продолжают закрываться каждый день. Вот с какой стороны тихое отчаяние заходит к нам в жизнь.

Только это все не про меня! Когда я был маленьким глупым мальчишкой, то сказал, что хочу делать компьютерные игры. Собственно, я их и делаю, так что у маленького глупого мальчишки все получилось. Когда у меня неудачный день, я чувствую себя толстым, лысеющим мужиком в рваном костюме Питера Пэна, который мне жутко мал. Когда у меня удачный день, вроде сегодняшнего, я понимаю, что поступил правильно, и что, похоже, принадлежу к ограниченному числу тех людей, что живут жизнь без сожалений. Сегодня (по крайней мере, когда я пишу эти строки) 31 марта. Майк завершает последние штрихи *Подземного Города*. Он ждет этого текста, который вы сейчас читаете. После того, как я передам его ему, мы будем готовы начать поставки 1 апреля, спустя ровно два года после выхода *ДРОД: Лабиринты Смерти*. Ну, слово "поставки" в данном случае более приятный, но неточный способ сказать, что мы будем готовы загрузить наши дистрибутивы на платный сервер. Да уж, "поставки" звучит гораздо лучше, чем ЗНДнПС.

Так что вы думаете насчет концовки? Вы поняли, что увидели? Это явно подкинуло Битро пищи для размышлений. Признаюсь, мы запланировали еще одно продолжение ДРОДа, возможно, последнюю часть тетралогии, начавшейся с *Дворцовых катакомб*, *Лабиринтов смерти* и *Подземного города*. Четвертая игра будет называться *Второе небо*, и расскажет нам о завершении расследований Битро в Подземном мире, а также о начале его действий, направленных на поддержку поверхности. Также мы выпустим несколько эпизодов в нашей "Коллекции Истребителей нечисти", которая вместит в себя период между *Подземным городом* и *Вторым небом*. Не думаю, правда, что мы раскроем историю *Второго неба*. В предыдущей "Коллекции Истребителей нечисти" мы не особо заморачивались с сюжетом, но в будущем мы сделаем на них более серьезный упор.

Ну вот, я немного подразнил вас "Вторым небом", однако, хочу предупредить вас, что следующей нашей полноформатной игрой будет не оно, и вообще игра не из серии ДРОД. Дам вам, пожалуй, некоторое время, чтобы вы могли прийти в себя от этой новости.

...

Да, это будет не ДРОД. Мы с Майком решили немного расправить крылья и попробовать сделать что-нибудь другое - то, о чем мы периодически фантазировали. К настоящему моменту я работал над различными версиями ДРОДа более десяти лет, а Майк помогал мне на протяжении важных пяти лет. Пришла пора воплотить в жизнь и другие идеи. Теперь мы можем продолжать вдохновляться тем, что делаем. Не беспокойтесь, мы не собираемся халтурить и выпускать клон тетриса или стрелялки от первого лица. Нет, это скорее всего будут хитроумные головоломки, которые все мы так любим.

Давайте скажем несколько слов о создателях, после чего я открою вам тайну.


[MID_ErikH_C_TCB]
[eng]
Concept, Direction, Story, Voice, Art
[rus]
Концепция, режиссура, сценарий, озвучка, художественное оформление

[MID_ErikH_Text_TCB]
[eng]
As usual, with these credits, I like to get myself out of the way first. I came up with the original concept of DROD back in the nineties. I wrote the overall story of DROD and handled some of dialogue writing personally. The majority of the dialogue was written by the level designers, which is an unusual practice that works quite well. I cast the voice actors for the parts and made sure all the lines got recorded. Some in-game art I made was inherited from previous games, and I added a little more. The cover illustration and packaging artwork for the game is mine too. Are we done with me now? Yes, good. Please consider that even though I tend to be the "voice" of the Caravel team--it is just that, a team. In fact, I'm not the person who has done the most work on the project or given it the most direction. That would be Mike Rimer.
[rus]
Как обычно бывает с этими титрами, я бы хотел сойти с пути первым. Еще в девяностых я разработал оригинальную концепцию ДРОДа. Я написал всю его историю и лично справился с частью диалогов. Большинство диалогов было написано дизайнерами уровней, что, хоть и является весьма необычной практикой, сработало довольно неплохо. Я отбирал актеров для озвучки и лично контролировал процесс записи. Что-то из созданного мною внутриигрового оформления я задействовал из предыдущих игр, что-то добавил заново. Иллюстрации обложки и художественное оформление упаковки игры также моих рук дело. Ну что, со мной мы закончили? Да, хорошо. Пожалуйста, не забывайте о том, что, хоть меня и считают "голосом команды", Caravel  - это именно команда. На самом деле, я не тот, кто сделал большую часть работы по проекту или задал ему основное направление. Этот человек - Майк Раймер.

[MID_MikeR_C_TCB]
[eng]
Producer, Lead Programmer, Feature Design, Level Design, Video Rendering, Art, Voice and Testing Coordination, Sound Effects and Voice Editing
[rus]
Продюсер, ведущий программист, дизайн деталей, дизайн уровней, переложение видео, художественное оформление, координация процесса озвучивания и тестирования, звуковая редакция

[MID_MikeR_Text_TCB]
[eng]
Mike made nearly every decision on what features would be in the game, and is more responsible for what the game became than any other person. He came up with his own feature ideas, and acted as a gatekeeper for other ideas that were suggested to him. Mike also made more rooms than anyone else by a wide margin, so you could definitely say he handled the brunt of level design. Mike coded *The City Beneath* almost single-handedly. He handled a lot of tedious, unglamorous tasks that just needed somebody to do it, like fixing bugs or posting builds for team members to use.
[rus]
Майку принадлежат практически все решения о наличии в игре того или иного компонента. Именно он в большей степени ответственен за то, что игра получилась такой, какой вы ее видите сегодня. Он приносил свои собственные идеи и был цензором для идей, исходивших с нашей стороны. Майк создал куда больше комнат, чем остальные участники проекта, так что его смело можно назвать главной ударной силой нашего уровнестроения. Майк практически в одиночку написал код для "Подземного города". Он проделал множество незаметной, рутинной работы, которую кому-то необходимо было сделать: как, например, исправление ошибок и предоставление новых версий программы членам команды.

[MID_MattS_C_TCB]
[eng]
CaravelNet Design and Programming, Feature Design, Testing, Art
[rus]
Дизайнер и программист CaravelNet, дизайн деталей, тестирование, художественное оформление

[MID_MattS_Text_TCB]
[eng]
The CaravelNet functionality belongs to Matt. He figured out how to get our server communicating with DROD to send demos, high scores, holds, and other information. He implemented a non-stop stream of changes to our website, the forum, and the order-taking process. Other indie developers out there would not even dream of attempting the stuff we have working. A larger retail developer/publisher company like EA or Blizzard would probably spec out a CaravelNet-like project to take a five-person team multiple man-years of work. Somehow, some way, one guy has delivered this huge amount of functionality. I would not recommend anyone else try doing it, unless they have Matt Schikore working for them, or about three hundred thousand dollars to blow through.
[rus]
За функционирование CaravelNet отвечает Мэтт. Он разбирается, как сделать так, чтобы наш сервер нормально взаимодействовал с ДРОДом, и мы могли посылать демонстрации, лучшие результаты, катакомбы и прочую информацию. Он обеспечивает неиссякаемый поток изменений на нашем веб-сайте, форуме и в процессе принятия заказов. Остальные разработчики независимых игр и мечтать не могут о тех вещах, над которыми мы работаем. Крупные розничные компании, занимающиеся разработкой и выпуском (например, EA или Blizzard), наверняка бы выделили на проект вроде CaravelNet команду из пяти человек и дали бы им несколько человеко-лет работы. В нашем же случае, одному человеку каким-то образом удалось обеспечить этот огромный объем функциональных возможностей. Я бы не рекомендовал больше никому пробовать это сделать, если им не возьмется помочь Мэтт Шикор, или если у них нет трехсот тысяч долларов, которые они запросто могут выбросить на ветер.

[MID_GerryJ_C_TCB]
[eng]
Programming, Linux port, Art, Feature Design
[rus]
Программирование, версия для Linux, художественное оформление, дизайн деталей

[MID_GerryJ_Text_TCB]
[eng]
It is hard to find someone that will take over a responsibility and stick with it for years. If you are playing DROD on Linux, you owe a lot of thanks to Gerry, who has provided Linux ports for all of the DROD games and their numerous patches. (Ugh. The patches.) Also, I knew Gerry had some art skills, but I had no idea he was so good with the pixels until he made a bunch of in-game graphics for *The City Beneath*. Perhaps people will look at his first-rate work and stop stigmatizing "programmer art".
[rus]
Трудно найти кого-то, кто возьмет на себя ответственность и не сложит ее на протяжении долгих лет. Если вы играете в ДРОД под Linux, то в первую очередь должны поблагодарить Джерри, который перенес в эту систему все игры серии и многочисленные патчи для них (ох уж эти патчи). К тому же, я знал, что у Джерри есть некоторые способности к рисованию, но и понятия не имел, насколько сильно он дружит с пикселями, пока он не создал большую часть внутриигровой графики для *Подземного Города*. Пожалуй, ознакомившись с его первоклассной работой, люди перестанут смеяться над словосочетанием "искусство программиста".

[MID_JonS_C_TCB]
[eng]
Music
[rus]
Музыка

[MID_JonS_Text_TCB]
[eng]
Jon is a professional musician who has a band (Travelogue) and recording label agreements to distribute his music. I've been a fan of his work since the mid-nineties. One day, I thought maybe I'd cold-call this synthpop superstar and ask him if he wanted to do some game music. It was a long shot, but I figured I had nothing to lose. I was greatly surprised that Jon agreed to the idea and came up with over 90 minutes of music for *The City Beneath* soundtrack. Nice!
[rus]
Джон - профессиональный музыкант, у которого есть своя группа (Travelogue) и контракт со звукозаписывающей компанией, распространяющей его музыку. С середины девяностых я буквально тащусь от его творчества. Как-то раз я подумал, что, может, я осторожно поговорю с этой суперзвездой синтепопа, и поинтересуюсь, не хотел бы он написать музыку для компьютерной игры. Шансов на успех было мало, но терять мне, в-общем-то, было нечего. Как же я удивился, когда Джон согласился и принес более полутора часов музыки для саундтрека к  *Подземному Городу*. Круто!

[MID_EytanZ_C_TCB]
[eng]
Story, Dialogue, Continuity, Level Design, Feature Design, Testing
[eng]
История, сюжет, диалоги, дизайн уровней, дизайн деталей, тестирование

[MID_EytanZ_Text_TCB]
[eng]
I was used to being the only guy that understood the world of the Eighth, but Eytan really surprised me on this project. He's got a full-fledged model of the story background in his head, and he sure knows how to use it. At times, he was able to correct inconsistencies in the story that I had made. Eytan wrote all the texts you see in the level introductions, enlarging the canon in several valuable ways. He also contributed a substantial amount of rooms and story, all of them crafted to his high standards. We relied on Eytan extensively.
[rus]
Я всегда был единственным, кто понимал мир Восьмерки, однако по ходу этого проекта, Эйтан меня сильно удивил. У него в голове была полностью готовая сюжетная модель, и он с ловкостью ей пользовался. Подчас ему даже удавалось находить в нашем повествовании нестыковки, которые допустил я. Эйтан написал все тексты для введений к уровням; часто его отходы от традиционной точки зрения служили нам добрую службу. Сложно переоценить и его вклад во множество комнат и историй, каждая из которых была выполнена с присущим ему мастерством. Без него мы как без рук.

[MID_NeilF_C_TCB]
[eng]
Level design, Feature Design, Story, Testing
[rus]
Дизайн уровней, дизайн деталей, сюжет, тестирование

[MID_NeilF_Text_TCB]
[eng]
We've been working with Neil for a long time. He's an excellent level designer that knows how to make rooms fun to play--not just hard. I also appreciate his solid personality and willingness to work on things that are prioritized by how much we need them.
[rus]
Мы с Нилом работаем вместе тысячу лет. Он прекрасный дизайнер уровней, который знает, как сделать комнаты не просто сложными, а увлекательными. Я также ценю его выдающиеся личные качества и стремление работать над тем, чему мы уделяем первостепенное внимание.

[MID_AdamP_C_TCB]
[eng]
Level Design, Feature Design, Art, Programming
[rus]
Дизайн уровней, дизайн деталей, художественное оформление, программирование

[MID_AdamP_Text_TCB]
[eng]
Adam has gradually gotten more involved with DROD on each release. Kind of like somebody poking their foot into cold water, shying away, dipping up to their calf, taking a moment for the shivers to subside, and so on... Well, he was all the way in the water for *The City Beneath*, and it was great to have his help.
[rus]
С каждым новым релизом ДРОДа, степень вовлеченности Адама в его разработку неуклонно растет. Это все равно, что входить в ледяную воду: заходишь по щиколотку, поворачиваешь назад, потом собираешься с духом, заходишь по пояс, переводишь дыхание, ждешь, пока пропадут мурашки, ну и так далее... Так вот, вплоть до *Подземного Города* он находился в воде, чем здорово нам помог.

[MID_ClaytonW_C_TCB]
[eng]
Level Design, Story, Testing, Feature Design
[eng]
Дизайн уровней, сюжет, тестирование, дизайн деталей

[MID_ClaytonW_Text_TCB]
[eng]
It was especially gratifying to see Clayton helping us on *The City Beneath*. He's a very talented and creative guy. His nickname has been "#1 DROD Fan" since he dressed up as Beethro for Halloween. Having him on the team really makes the game feel like it was built by people that care about it.
[rus]
Нам очень льстит, что Клейтон помогал нам с *Подземным Городом*. Он очень творчески одаренный человек. Когда он на Хэллоуин нарядился в костюм Битро, то тут же получил прозвище "Фанат ДРОДа №1". Благодаря его участию в нашей команде, игра выглядит так, как будто создавалась руками людей, которые по-настоящему ей увлечены.

[MID_WilliamF_C_TCB]
[eng]
Art
[rus]
Художественное оформление

[MID_WilliamF_Text_TCB]
[eng]
You may know William as "Vylycyn" on the forum. And you might have seen a lot of cool DROD-related artwork he's posted there too. I snagged him early on to do graphics for the three new styles in *The City Beneath*. It was a good choice. He put together some great walls and floors, and went on to make quite a few obstacle graphics for us as well.
[rus]
Вы могли встретить Вильяма на форуме под ником "Vylycyn". А еще вы могли видеть множество иллюстраций, посвященных ДРОДу, которые он там размещал. Я перехватил его еще раньше, чтобы он поработал над графикой для трех новых стилей *Подземного Города*. Я не ошибся с выбором. Он совместил отличные стены и напольные покрытия, а также поработал над графикой для кое-каких препятствий.

[MID_AshleyK_C_TCB]
[eng]
Art
[rus]
Художественное оформление

[MID_AshleyK_Text_TCB]
[eng]
Ashley made us tile graphics for a chest and a table. She didn't have too much time to create art for this project, but what she did contribute was well done, and I appreciate her help.
[rus]
Эшли создала графику ячеек сундука и стола. У нее было немного времени на художественное оформление этого проекта, однако то, что она для него сделала, было на высшем уровне. Я очень ценю ее вклад

[MID_VoiceTalent_TCB]
[eng]
The Cast
[rus]
Актерский состав

[MID_VoiceTalent_C_TCB]
[eng]

[MID_VoiceTalent_Text_TCB]
[eng]
These are the voice actors who recorded parts for the game. It is our largest cast to date, and everyone in it was carefully chosen. I hope you enjoyed their performances.

Sten Ryason - Beethro
Erik Hermansen - Slayers, Goblins, Guards, Stalwarts
Mike Rimer - Slayers, Tar Mother, Aumtlich
Brittany Hermansen - 86th Negotiator
Michael Abbott - Pit Thing, Slayers, Stalwart, Citizens
Patrick Alexander - Slayers, Citizens
Erik Ottosen - Gossip, Slayers, Citizens
Roger "Rescator" Hagensen - Slayers, Citizens
Mark Thebridge - Goblin King, Slayers, Citizens
Tony Porter - First Archivist
Steve Anderson - Chief Drokkendut, Patrons, Danforth Strout, Stalwart Captain
Sean Hunt - Halph, Boy, Slayer
Elfstone - Gossip
Clayton Weiss - First Librarian
Elna Miller - Guide 186, Gristy
Mike Kasprzak - Guards
Kathy Sherman - City Repairman
Bit Parts - almost everyone above
[rus]
Эти люди озвучивали персонажей игры. К настоящему моменту это самый большой наш актерский состав, каждый из них прошел тщательный отбор. Надеюсь, вам придется по душе то, что они сделали.

Sten Ryason - Битро
Erik Hermansen - Головорезы, Гоблины, Стражники, Штальвартцы
Mike Rimer - Головорезы, Смоломатка, Аумтлих
Brittany Hermansen - 86-я Переговорщица
Michael Abbott - Тварь из ямы, Головорезы, Штальвартец, Горожане
Patrick Alexander - Головорезы, Горожане
Erik Ottosen - Сплетник, Головорезы, Горожане
Roger "Rescator" Hagensen - Головорезы, Горожане
Mark Thebridge - Король гоблинов, Головорезы, Горожане
Tony Porter - Первый Архивариус
Steve Anderson - Шеф Дроккендат, Покровители, Данфорт Страут, Капитан Штальвартцев
Sean Hunt - Хальф, Мальчик, Головорез
Elfstone - Сплетник
Clayton Weiss - Первый Библиотекарь
Elna Miller - Проводник номер 186, Гристи
Mike Kasprzak - Стражники
Kathy Sherman - Городской ремонтник
Всякая мелочь - почти все вышеперечисленные

[MID_Testers_TCB]
[eng]
Eytan Zweig
Neil Frederick
Stefan Michelsson
Wai Lam
Clayton Weiss
Mark Thebridge
Sean Hunt
Adam Peterson
Martin Jacobsen
Stuart Knapton
T Scott Lanigan
Chris Marks
Brad Wall
Matthew Cramp
John Williams
Seth Rimer
Elfstone

[MID_Testers_Text_TCB]
[eng]
At any chance given to me, I will brag about our testers. I really think it is possible that we have the best volunteer game testers in the world. Other indie game developers get unhelpful bug reports like "Hmm. Something doesn't work for me. Game crashed." A Caravel tester will say, "I was in 4n2e on Uncturage, and just as I moved east off the edge of the screen, but before it began scrolling, the screen went black. Music continued to play, but I was unable to do anything after that. I restarted from a save game, tried it again, and it did the same thing. Attached is a copy of the error log. This looks similar to the bug that Stefan reported earlier--maybe the same thing? Let me know if you want me to run any more tests." Get the idea? Our testers are intelligent, articulate, and dedicated to the game. I am proud to be associated with them.
[rus]
Как только мне представляется такая возможность, я хвастаюсь нашими тестерами. Я и правда думаю, что у нас, возможно, самые лучшие тестеры-добровольцы в мире. Остальные независимые разработчики получают бесполезные отчеты об ошибках вроде "Хм, что-то у меня тут не работает. Игра вылетает". А вот тестер Caravel скажет "Я был в 4n2e в Помазанке, и как только я двинулся на восток от края экрана, до того, как пошла прокрутка, экран стал черным. Музыка продолжала играть, но после этого я не мог ничего сделать Я загрузил сохраненную игру, попробовал снова, и все повторилось. В приложении копия отчета об ошибке. Это похоже на глюк, о котором уже сообщал Стефан, может, это он же? Дайте мне знать, если захотите, чтобы я произвел дополнительное тестирование." Понимаете, о чем я? Наши тестеры умны, способны ясно сформулировать свою мысль и всецело преданы игре. Я горжусь, что мне посчастливилось с ними работать.

[MID_CreditsLastWords_TCB]
[eng]
Okay, time to give you the secret. The secret is that...


















Oh, wait! You aren't going to tell anyone, right? Really, this is a secret just for people who have completed *DROD: The City Beneath*. And if somebody asks you about the secret, and they even say they've completed the game, you shouldn't give them the secret. Just tell them to restore to the end of the game and play through the credits again, taking note of the secret at the end. And if they whine about accidentally losing their saved games in a bicycling accident, then you tell them, "tough cookies". They can play through the game again. You gotta be hard with these people.

Clear? Okay, get some paper and a pen. And remember that you can pause and unpause text scrolling with the space bar. Here is the secret...


















Say that you want to learn if someone has completed *The City Beneath*. You say to them, perhaps in e-mail or on the Caravel Forum, "By the Law of Snuddick Frolem and his brother X, I demand Y provide proof of passage." Where it says "X", you insert a made-up name, like "his brother Whillis" or "his brother Brimbly" or "his brother Fluck". Where it says "Y", you put the name of the person to whom this challenge is issued. The protocol is that only this person would answer the challenge, and when he responds back, he should follow this format: "My passage was made. You can ask Z, who bore witness." Z is another name that must meet certain criteria to follow the protocol. For every letter in X, use the next letter up in the 26-letter English alphabet, with "z" wrapping back to "a". This produces a collection of letters which must be present in sequence for Z. So if X is "Brimbly" then the letters that must be present in Z are "CSJNCMZ". Letters should be added to Z to make it sound more like a pronounceable name, for example, "Crossujit Naddicumuz" (CroSsuJit NaddiCuMuZ). In this example, the responding text should be "My passage was made. You can ask Crossujit Naddicumuz, who bore witness." If you want, you can have more than one witness name, i.e. "Crod Sempit, Jondo Criff, and Moofin Zeeb". As long as all the letters are present and in sequence for Z, it will be accepted that you are following the protocol and have given proof of passage.

It is strongly discouraged that anyone who is not specifically challenged would reply back with an answer. If multiple people give correct answers to the same challenge, it will become much easier for outsiders to break the code.

Have fun! We all thank you for playing.

-Erik
[rus]
Ладно, пришло время открыть вам секрет. Дело в том...


















Ой, погодите! Вы же никому не скажете, правда? На самом деле, этот секрет предназначен только для тех, кто прошел *ДРОД: Подземный Город*. И если кто-то еще спросит вас об этом секрете, и даже скажет, что прошел игру, вы не должны его ему рассказывать. Скажите ему, чтобы он загрузил концовку игры и еще раз перечитал титры, потому что секрет находится в их конце. А если он начнет ныть, дескать, все сохраненные игры он потерял в страшной велосипедной аварии, скажите ему, что он крепкий орешек. Ничего, пройдет игру заново. С этими людьми надо построже.

Все понятно? Ладно, возьмите бумагу и ручку. И помните, что при помощи клавиши Пробел вы можете останавливать и возобновлять прокрутку текста. Так вот, секрет...


















Скажите, что вы хотите узнать, прошел ли кто-то *Подземный Город*. Скажете им, например, в письме или на форуме, "Именем закона Снаддика Фролема и его брата X, я требую, чтобы Y предоставил доказательства прохождения." Вместо "X" можете вставить любое вымышленное имя, например, "его брата Виллиса", или "его брата Бримбли", или "его брата Флака". Вместо "Y" поставьте имя человека, к которому обращен этот вызов. Штука в том, что только этот человек должен ответить на вызов и сказать следующее: "Мое прохождение осуществлено. Можешь спросить Z, который лицезрел его." Z - это еще одно имя, которое должно удовлетворять некоторому критерию по условиям этой процедуры. Для каждой буквы имени X, используйте букву, следующую за ней в 26-литерном английском алфавите, где за "z" будет следовать "a". Это даст вам определенный набор букв, который должен быть подвергнут такой же процедуре в случае с именем Z. Поэтому если  X - это "Brimbly", то буквы в имени Z должны быть "CSJNCMZ". Добавьте сюда несколько букв, чтобы слегка облагородить его звучание - например, "Crossujit Naddicumuz" (CroSsuJit NaddiCuMuZ). В этом примере, нужный текст будет таким: "Мое прохождение осуществлено. Можешь спросить Crossujit Naddicumuz, который лицезрел его." Если хотите, то можете использовать несколько имен свидетелей, например, Crod Sempit, Jondo Criff и Moofin Zeeb. Если все буквы в последовательности Z на месте, значит, протокол соблюден, и вы получили доказательство прохождения.

Очень не хотелось бы, чтобы кто-то неподготовленный пересылал ответы. Если много людей получит правильные ответы на один и тот же вопрос, людям со стороны будет гораздо проще взломать код.

Приятного вам времяпрепровождения! Мы все говорим вам "спасибо" за то, что играете.

-Эрик

[MID_CreditsTheEnd_TCB]
[eng]
The City Beneath

(c) 2006, 2007, 2008, 2016 Caravel Games, LLC
www.caravelgames.com
[rus]
Подземный Город

(c) 2006, 2007, 2008, 2016 Caravel Games, LLC
www.caravelgames.com
